[
    {},
    {
        "title": "Elliott Advisors Publishes Letter on Taylor Wimpey",
        "content": "LONDON--(BUSINESS WIRE)--Elliott Advisors (UK) Limited sent the following letter to the Board of Taylor Wimpey plc today. 10 December 2021 The Board of Directors Taylor Wimpey plc Turnpike Road High Wycombe HP12 3NR Attn. Irene Mitchell Dorner, Chairman Dear …"
    },
    {
        "title": "US consumer prices increase further in Nov, largest annual gain since 1982",
        "content": "In the 12 months through November, the CPI was accelerated by 6.8%."
    },
    {
        "title": "Don Lemon brands pal Jussie Smollet a liar",
        "content": "Lemon discussed the \"Empire\" star's guilty verdict on his show Thursday night."
    },
    {
        "title": "Oracle: Key Investor Takeaways From Q2 2022 Earnings",
        "content": "Oracle's growth in the cloud continues, while margins remain elevated. Here's what caught my attention from ORCL's Q2 2022 earnings report and conference call."
    },
    {
        "title": "More Nevada Democrats Switching Parties Than GOP",
        "content": "Nevada Independent: \"More than two and a half times as many Democrats have switched their voter registrations to Republicans as vice-versa during the last three months, a statistic with ominous portents for Democratic candidates.\"\"The numbers since September …"
    },
    {
        "title": "Peloton Responds To ‘And Just Like That’ Premiere Twist",
        "content": "The Sex and the City reboot kicked things off with some heartbreaking product placement."
    },
    {
        "title": "Union battles at Amazon and Starbucks are hot news – which can only be good for the labor movement",
        "content": "(The Conversation is an independent and nonprofit source of news, analysis and commentary from academic experts.)\nJohn Logan, San Francisco State University\n(THE CONVERSATION) Union drives have suddenly become hot news.\nIn a closely watched Nov. 29, 2021, dec…"
    },
    {
        "title": "Dominic Cummings calls Carrie Johnson a 'wrong 'un' and says Boris 'will go next year'",
        "content": "The Prime Minister's former chief aide, who left No 10 last December after losing a power struggle with Mrs Johnson, claimed the PM's decision to marry his third wife was an 'inevitable disaster'."
    },
    {
        "title": "Station master and his dog George are welcomed BACK to Surrey ticket office as bosses U-turn",
        "content": "Today both Richard Bunce, 54, and his dog George, were officially welcomed back by rail users and company boss Claire Mann to Horsley station in East Horsley."
    },
    {
        "title": "Flashback Quote of the Day",
        "content": "\"Well, there's some Republicans now in the party who don't, you know, don't want to cross the aisle work with the Democrats. They don't really want to do much of anything. I mean, they're got some in the House that their primary goal is to get rid of John Boe…"
    },
    {
        "title": "We invited an AI to debate its own ethics – in the Oxford Union",
        "content": "The ethics of AI are constantly debated. But does anyone ask the AI?"
    },
    {
        "title": "ऊंटों की ब्यूटी प्रतियोगिता में हुई धांधली, खूबसूरती बढ़ाने के लिए 40 को लगाया बोटॉक्स इंजेक्शन, लगा लाखों का जुर्माना",
        "content": "Saudi authorities have conducted their biggest-ever crackdown on camel beauty contestants that received Botox injections and other artificial touch-ups, the state-run Saudi Press Agency reported Wednesday, with over 40 camels disqualified from the annual page…"
    },
    {
        "title": "YouTube TV Launches on Xfinity Flex",
        "content": null
    },
    {
        "title": "Energy justice and local solar go hand-in-hand",
        "content": "Local energy resources have the potential to equitably distribute the benefits of clean energy in a way that provides jobs, resilience and savings to communities left out of our century-old electricity grid."
    },
    {
        "title": "Putin barrels toward invading Ukraine, encouraged by Trump (David Ignatius/Washington Post)",
        "content": "David Ignatius / Washington Post:\nPutin barrels toward invading Ukraine, encouraged by Trump  —  Russian President Vladimir Putin's path toward threatening an invasion of Ukraine is marked by reckless actions.  In this move toward defiance of international no…"
    },
    {
        "title": "Characterizing a crystal structure of a californium metallocene",
        "content": "A team of researchers working at Los Alamos National Laboratory in New Mexico has successfully characterized a crystal structure of a californium metallocene. In their paper published in the journal Nature, the group describes their carefully orchestrated pro…"
    },
    {
        "title": "Nobel Peace Prize winner blasts social media giants for 'allowing a virus of lies to infect us all'",
        "content": "Philippine journalist Maria Ressa, the co-founder of news website Rappler, which runs articles highly critical of president Rodrigo Duterte, used her speech to blast tech for 'triggering the worst in us'."
    },
    {
        "title": "CPPIB backs Octopus Energy Group",
        "content": "Canada Pension Plan Investment Board has invested $300 million in Octopus Energy Group, a London, UK-based renewable energy company."
    },
    {
        "title": "Manchester United midfielder Scott McTominay responds to criticism",
        "content": "Scott McTominay has recently responded to the criticism he has faced as a Manchester United player.Scott McTominay responds to criticismFor some time now, the biggest weak point in Manchester United’s star-studded squad has, on paper, been their midfield.With…"
    },
    {
        "title": "Critical RCE Zero-Day Exploit Found in Popular Java Logging Library log4j, Affects Much Of The Internet",
        "content": "A critical remote code execution vulnerability has been found in log4j, a very popular logging tool used by most of the industry. It’s extremely severe, affecting nearly every server running Java, and is very simple to exploit, so you will want to update and …"
    }
]